# Дано натуральное число N и
# последовательность из N элементов.
# Требуется вывести эту последовательность в
# обратном порядке.
# Примечание. В программе запрещается
# объявлять массивы и использовать циклы
# (даже для ввода и вывода).
# Input: 2 -> 3 4
# Output: 4 3

def reversal(n):
    if n == 0:
        return ''
    res = input()
    return reversal(n-1) + f'{res}'

print(reversal(5))